import streamlit as st

# Title and Introduction
st.title("مقدمة: فهم سوق العمل للخريجين الجدد")
st.markdown(
    """
تخيل أنك في بداية رحلتك المهنية، خرجت للتو من الجامعة وتتطلع لدخول سوق العمل. 
قد تتساءل: ما نوع الفرص المتاحة لشخص لديه خبرة قليلة أو معدومة؟ ما هي الوظائف التي قد توفر دخلاً مستقراً من البداية؟ وأي نوع من الشركات يبحث بنشاط عن خريجين جدد؟
  سنستعرض ثلاث نقاط رئيسية ستمنحك فهمًا قويًا للمشهد الوظيفي الحالي للخريجين الجدد.
    """
    
)


# Section 1: Number of Jobs Based on Experience Level
st.header("1. عدد الوظائف بناءً على الخبرة")
st.markdown(
    """
    غالبًا ما يقلق الخريجون الجدد من أن نقص الخبرة قد يكون عائقًا في الحصول على وظيفة. ولكن الخبر السار هو أن العديد من الجهات تبحث بنشاط عن المواهب الجديدة وتقدّر الحماس والقدرة على التكيف والإمكانيات التي يجلبها الخريجون الجدد. إليك رسمة توضيحية:
    """
    
)

###CHART

st.markdown("هذا يوضح أنه حتى إذا كنت بدون خبرة كبيرة، فهناك الكثير من الوظائف المتاحة خصيصًا للخريجين الذين لديهم استعداد للتعلم.")


# Section 2: Expected Salary Range for Fresh Graduates Based on Job Title
st.header("2. نطاق الراتب المتوقع للخريجين الجدد")
st.markdown("""
بمجرد أن تحصل على وظيفة في المستوى المبتدئ، يأتي السؤال الكبير التالي حول الراتب. تتفاوت رواتب الخريجين الجدد بناءً على الوظيفة، والمهارات المطلوبة، والصناعة. إليك نظرة عامة على متوسط رواتب  بين الخريجين الجدد:
"""
)


###CHART

st.markdown(
"""
تختلف نطاقات الرواتب حسب الوظيفة, نوع الشركة, المهارات المطلوبة. رغم ان هذه تقديرات تقريبية فإن فهم نطاق متوسط الرواتب يساعد في فهم سوق العمل للخريجين الجدد.
"""
)

# Section 3: Company Types Hiring Fresh Graduates

st.header("3. أنواع الشركات التي توظف الخريجين الجدد بشكل مكثف")
st.markdown("""
        الآن بعد أن أصبح لديك شعور بتوافر الوظائف وتوقعات الراتب ، فإن الخطوة التالية هي تحديد أنواع الشركات التي من المرجح أن توظفك. تقوم بعض القطاعات بتوظيف الخريجين الجدد بنشاط ، مع إدراك إمكاناتهم للنمو والأفكار الجديدة. إن معرفة مكان تركيز البحث يمكن أن يوفر لك الوقت ويزيد من فرصك في الحصول على وظيفة.
            """
             )
###CHART

st.markdown(
    """
    يوضح هذا الرسم البياني أن الشركات الخاصة تنشر غالبية الوظائف التي لا تتطلب خبرة ، في حين أن الأدوار شبه الحكومية أقل. وهذا يشير إلى أن الشركات الخاصة تميل إلى تقديم المزيد من الوظائف المبتدئة، مما يجعلها هدفا قويا للخريجين الجدد الذين يتطلعون إلى بدء حياتهم المهنية.
    """
    
)